#### Terraform Format and Style 🖌`success`
#### hca-prod - Terraform Initialization ⚙️`success`
#### hca-prod - Terraform Validation 🤖Success! The configuration is valid.


#### hca-prod - Terraform Plan 📖`success`

<details><summary>hca-prod - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.cloudsql.random_id.db_password["argo"]: Refreshing state... [id=3K99sIJrlP3iLczM0uNFIQ]
module.cloudsql.random_id.cloudsql_random_id: Refreshing state... [id=kMqWvQXHtbM]
data.google_dns_managed_zone.prod_zone: Refreshing state...
module.ebi_staging_notification_pubsub_topic.data.google_project.project: Refreshing state...
module.ebi_staging_notification_pubsub_topic.google_pubsub_topic.topic[0]: Refreshing state... [id=projects/mystical-slate-284720/topics/staging-transfer-notifications.ebi]
google_storage_bucket.ebi_bucket: Refreshing state... [id=broad-dsp-monster-hca-prod-ebi-storage]
module.ebi_writer_account.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket.hca_argo_archive: Refreshing state... [id=broad-dsp-monster-hca-prod-argo-archive]
google_storage_bucket.temp_bucket: Refreshing state... [id=broad-dsp-monster-hca-prod-temp-storage]
data.google_project.current_project: Refreshing state...
module.hca_gke_runner_account.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_dataflow_account.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket.staging_storage: Refreshing state... [id=broad-dsp-monster-hca-prod-staging-storage]
module.enable_services.google_project_service.cloud_resource_manager: Refreshing state... [id=mystical-slate-284720/cloudresourcemanager.googleapis.com]
google_storage_bucket.ucsc_bucket: Refreshing state... [id=broad-dsp-monster-hca-prod-ucsc-storage]
module.master.data.google_project.project: Refreshing state...
google_storage_bucket_iam_member.ucsc_bucket_iam["hannes@ucsc.edu"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.admin/user:hannes@ucsc.edu]
module.enable_services.google_project_service.service_usage: Refreshing state... [id=mystical-slate-284720/serviceusage.googleapis.com]
data.google_storage_transfer_project_service_account.sts_account: Refreshing state...
google_storage_bucket_iam_member.ucsc_bucket_iam["dsotirho@ucsc.edu"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.admin/user:dsotirho@ucsc.edu]
module.ebi_staging_notification_pubsub_topic.google_pubsub_subscription.pull_subscriptions[0]: Refreshing state... [id=projects/mystical-slate-284720/subscriptions/ebi-writer]
google_storage_bucket_iam_member.ebi_sa_bucket_iam["ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.admin/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.ebi_bucket_iam["enrique@ebi.ac.uk"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.admin/user:enrique@ebi.ac.uk]
google_storage_bucket_iam_member.ebi_bucket_iam["rolando@ebi.ac.uk"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.admin/user:rolando@ebi.ac.uk]
module.ebi_writer_account.null_resource.sa_delay: Refreshing state... [id=6143318435796113693]
google_storage_bucket_iam_member.staging_account_iam_reader: Refreshing state... [id=b/broad-dsp-monster-hca-prod-staging-storage/roles/storage.objectViewer/serviceaccount:terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com]
module.ebi_writer_account.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com/keys/0db8722776c06e977694b69f4bbba508dd92b517]
module.hca_gke_runner_account.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com/keys/a6e4aacbd0cf5df872b1bdcb444a80b358479824]
module.hca_gke_runner_account.null_resource.sa_delay: Refreshing state... [id=5830129711160933720]
module.hca_argo_runner_account.null_resource.sa_delay: Refreshing state... [id=3345864264350360758]
module.hca_argo_runner_account.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com/keys/d4facd05d8caeeaa15e8d3a946a5afe5d044fdac]
module.hca_dataflow_account.null_resource.sa_delay: Refreshing state... [id=4570224320786554972]
module.ebi_writer_account.google_project_iam_member.sa_iam["storagetransfer.user"]: Refreshing state... [id=mystical-slate-284720/roles/storagetransfer.user/serviceaccount:ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_dataflow_account.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com/keys/09b6bc02c5819434293efe5fdb8340883b6b2feb]
module.ebi_writer_account.google_project_iam_member.sa_iam["storagetransfer.viewer"]: Refreshing state... [id=mystical-slate-284720/roles/storagetransfer.viewer/serviceaccount:ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.ebi_writer_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectAdmin/serviceaccount:ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
google_pubsub_topic_iam_member.ebi_writer_iam: Refreshing state... [id=projects/mystical-slate-284720/topics/staging-transfer-notifications.ebi/roles/pubsub.publisher/serviceaccount:ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
google_pubsub_subscription_iam_member.ebi_writer_iam: Refreshing state... [id=projects/mystical-slate-284720/subscriptions/ebi-writer/roles/pubsub.subscriber/serviceaccount:ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
module.cloudsql.vault_generic_secret.postgres_user["argo"]: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/cloudsql/users/argo]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["logging.logWriter"]: Refreshing state... [id=mystical-slate-284720/roles/logging.logWriter/serviceaccount:hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["monitoring.metricWriter"]: Refreshing state... [id=mystical-slate-284720/roles/monitoring.metricWriter/serviceaccount:hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["monitoring.viewer"]: Refreshing state... [id=mystical-slate-284720/roles/monitoring.viewer/serviceaccount:hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.ebi_staging_notification_pubsub_topic.google_pubsub_topic_iam_member.pull_topic_binding[0]: Refreshing state... [id=projects/mystical-slate-284720/topics/staging-transfer-notifications.ebi/roles/pubsub.publisher/serviceaccount:service-612961917858@gcp-sa-pubsub.iam.gserviceaccount.com]
module.ebi_staging_notification_pubsub_topic.google_pubsub_subscription_iam_member.pull_subscription_binding[0]: Refreshing state... [id=projects/mystical-slate-284720/subscriptions/ebi-writer/roles/pubsub.subscriber/serviceaccount:service-612961917858@gcp-sa-pubsub.iam.gserviceaccount.com]
module.ebi_staging_notification_pubsub_topic.google_project_iam_member.token_creator_binding[0]: Refreshing state... [id=mystical-slate-284720/roles/iam.serviceAccountTokenCreator/serviceaccount:service-612961917858@gcp-sa-pubsub.iam.gserviceaccount.com]
google_storage_bucket_iam_member.hca_argo_temp_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-temp-storage/roles/storage.admin/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_service_account_iam_binding.hca_workload_identity_binding: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_storage_bucket_iam_member.hca_argo_staging_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-staging-storage/roles/storage.admin/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.hca_argo_logs_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-argo-archive/roles/storage.admin/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["bigquery.jobUser"]: Refreshing state... [id=mystical-slate-284720/roles/bigquery.jobUser/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["dataflow.developer"]: Refreshing state... [id=mystical-slate-284720/roles/dataflow.developer/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["bigquery.dataOwner"]: Refreshing state... [id=mystical-slate-284720/roles/bigquery.dataOwner/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["compute.viewer"]: Refreshing state... [id=mystical-slate-284720/roles/compute.viewer/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_service_account_iam_binding.dataflow_runner_user_binding: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com/roles/iam.serviceAccountUser]
module.hca_dataflow_account.google_project_iam_member.sa_iam["dataflow.worker"]: Refreshing state... [id=mystical-slate-284720/roles/dataflow.worker/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ucsc_reader_iam["hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.objectViewer/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ucsc_reader_iam["jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.objectViewer/serviceaccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ucsc_reader_iam["terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.objectViewer/serviceaccount:terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com]
module.ebi_writer_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/ebi-storage-writer]
google_storage_bucket_iam_member.tdr_ebi_reader_iam["hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectViewer/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ebi_reader_iam["jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectViewer/serviceaccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ebi_reader_iam["terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectViewer/serviceaccount:terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com]
module.hca_gke_runner_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/gke-runner]
module.hca_argo_runner_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/hca-argo-runner]
module.hca_dataflow_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/hca-dataflow-runner]
google_storage_bucket_iam_member.sts_iam["storage.legacyBucketWriter"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.legacyBucketWriter/serviceaccount:project-612961917858@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.objectViewer"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectViewer/serviceaccount:project-612961917858@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.legacyBucketReader"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.legacyBucketReader/serviceaccount:project-612961917858@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.staging_bucket_runner_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-staging-storage/roles/storage.admin/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.temp_bucket_runner_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-temp-storage/roles/storage.admin/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.enable_services.google_project_service.services[11]: Refreshing state... [id=mystical-slate-284720/runtimeconfig.googleapis.com]
module.enable_services.google_project_service.services[8]: Refreshing state... [id=mystical-slate-284720/replicapool.googleapis.com]
module.enable_services.google_project_service.services[13]: Refreshing state... [id=mystical-slate-284720/sql-component.googleapis.com]
module.enable_services.google_project_service.services[17]: Refreshing state... [id=mystical-slate-284720/dataflow.googleapis.com]
module.enable_services.google_project_service.services[5]: Refreshing state... [id=mystical-slate-284720/iamcredentials.googleapis.com]
module.enable_services.google_project_service.services[2]: Refreshing state... [id=mystical-slate-284720/containerregistry.googleapis.com]
module.enable_services.google_project_service.services[4]: Refreshing state... [id=mystical-slate-284720/iam.googleapis.com]
module.enable_services.google_project_service.services[6]: Refreshing state... [id=mystical-slate-284720/logging.googleapis.com]
module.enable_services.google_project_service.services[9]: Refreshing state... [id=mystical-slate-284720/replicapoolupdater.googleapis.com]
module.enable_services.google_project_service.services[10]: Refreshing state... [id=mystical-slate-284720/resourceviews.googleapis.com]
module.enable_services.google_project_service.services[14]: Refreshing state... [id=mystical-slate-284720/stackdriver.googleapis.com]
module.enable_services.google_project_service.services[12]: Refreshing state... [id=mystical-slate-284720/sqladmin.googleapis.com]
module.enable_services.google_project_service.services[3]: Refreshing state... [id=mystical-slate-284720/dns.googleapis.com]
module.enable_services.google_project_service.services[16]: Refreshing state... [id=mystical-slate-284720/storage-component.googleapis.com]
module.enable_services.google_project_service.services[1]: Refreshing state... [id=mystical-slate-284720/container.googleapis.com]
module.enable_services.google_project_service.services[19]: Refreshing state... [id=mystical-slate-284720/pubsub.googleapis.com]
module.enable_services.google_project_service.services[7]: Refreshing state... [id=mystical-slate-284720/monitoring.googleapis.com]
module.enable_services.google_project_service.services[18]: Refreshing state... [id=mystical-slate-284720/storagetransfer.googleapis.com]
module.enable_services.google_project_service.services[0]: Refreshing state... [id=mystical-slate-284720/compute.googleapis.com]
module.enable_services.google_project_service.services[15]: Refreshing state... [id=mystical-slate-284720/storage-api.googleapis.com]
module.cloudsql.google_sql_database_instance.postgres: Refreshing state... [id=command-center-postgres-90ca96bd05c7b5b3]
module.dns_names.google_compute_global_address.global_ip_address["hca-grafana"]: Refreshing state... [id=projects/mystical-slate-284720/global/addresses/hca-grafana-ip]
module.cloudsql.module.proxy_sa.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/command-center-proxy-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.k8s_network.google_compute_network.network: Refreshing state... [id=projects/mystical-slate-284720/global/networks/hca-network]
module.dns_names.google_compute_global_address.global_ip_address["hca-argo"]: Refreshing state... [id=projects/mystical-slate-284720/global/addresses/hca-argo-ip]
module.k8s_network.google_compute_address.nat_addresses[1]: Refreshing state... [id=projects/mystical-slate-284720/regions/us-central1/addresses/hca-network-nat-1]
module.k8s_network.google_compute_address.nat_addresses[0]: Refreshing state... [id=projects/mystical-slate-284720/regions/us-central1/addresses/hca-network-nat-0]
module.cloudsql.vault_generic_secret.postgres_connection_name: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/cloudsql/instance]
module.cloudsql.google_sql_user.db_user["argo"]: Refreshing state... [id=argo//command-center-postgres-90ca96bd05c7b5b3]
module.cloudsql.module.proxy_sa.null_resource.sa_delay: Refreshing state... [id=3815916769449075674]
module.cloudsql.module.proxy_sa.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/command-center-proxy-runner@mystical-slate-284720.iam.gserviceaccount.com/keys/cbdfe0b54105601688b21a47b76fe28cd826bab9]
module.cloudsql.module.proxy_sa.google_project_iam_member.sa_iam["cloudsql.client"]: Refreshing state... [id=mystical-slate-284720/roles/cloudsql.client/serviceaccount:command-center-proxy-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.dns_names.google_dns_record_set.a_dns["hca-argo"]: Refreshing state... [id=monster-prod/hca-argo-global.monster-prod.broadinstitute.org./A]
module.dns_names.google_dns_record_set.a_dns["hca-grafana"]: Refreshing state... [id=monster-prod/hca-grafana-global.monster-prod.broadinstitute.org./A]
module.k8s_network.google_compute_router.router: Refreshing state... [id=projects/mystical-slate-284720/regions/us-central1/routers/hca-network-router]
module.k8s_network.google_compute_subnetwork.subnetworks[0]: Refreshing state... [id=projects/mystical-slate-284720/regions/us-central1/subnetworks/hca-network]
module.cloudsql.module.proxy_sa.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/command-center-proxy-runner]
module.dns_names.google_dns_record_set.cname_dns["hca-grafana"]: Refreshing state... [id=monster-prod/hca-grafana.monster-prod.broadinstitute.org./CNAME]
module.dns_names.google_dns_record_set.cname_dns["hca-argo"]: Refreshing state... [id=monster-prod/hca-argo.monster-prod.broadinstitute.org./CNAME]
module.k8s_network.google_compute_router_nat.nat: Refreshing state... [id=mystical-slate-284720/us-central1/hca-network-router/hca-network-nat]
module.master.google_container_cluster.master: Refreshing state... [id=projects/mystical-slate-284720/locations/us-central1-c/clusters/hca-cluster]
module.master.vault_generic_secret.master_secrets: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/gke]
module.node_pool.google_container_node_pool.pool: Refreshing state... [id=projects/mystical-slate-284720/locations/us-central1-c/clusters/hca-cluster/nodePools/hca-node-pool]
module.cloudsql.google_sql_database.db["argo"]: Refreshing state... [id=projects/mystical-slate-284720/instances/command-center-postgres-90ca96bd05c7b5b3/databases/argo]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_project_iam_custom_role.argo_access will be created
  + resource "google_project_iam_custom_role" "argo_access" {
      + deleted     = (known after apply)
      + description = "Ability to interact with the REST API exposed by a Kubernetes cluster running Argo Workflows UI."
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "container.thirdPartyObjects.create",
          + "container.thirdPartyObjects.delete",
          + "container.thirdPartyObjects.get",
          + "container.thirdPartyObjects.list",
          + "container.thirdPartyObjects.update",
        ]
      + project     = (known after apply)
      + role_id     = "argoworkflows.user"
      + stage       = "GA"
      + title       = "Argo Workflows API User"
    }

  # google_project_iam_member.argo_access_member will be created
  + resource "google_project_iam_member" "argo_access_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = (known after apply)
    }

  # google_service_account_iam_binding.hca_dagster_workload_identity_binding will be created
  + resource "google_service_account_iam_binding" "hca_dagster_workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:mystical-slate-284720.svc.id.goog[dagster/monster-dagster]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_binding.kubernetes_role_binding will be created
  + resource "google_service_account_iam_binding" "kubernetes_role_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:mystical-slate-284720.svc.id.goog[dagster/monster-dagster]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket_iam_member.ebi_bucket_iam will be created
  + resource "google_storage_bucket_iam_member" "ebi_bucket_iam" {
      + bucket = "broad-dsp-monster-hca-prod-ebi-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:ait-hca@ebi.ac.uk"
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.ebi_bucket_iam["enrique@ebi.ac.uk"] will be destroyed
  - resource "google_storage_bucket_iam_member" "ebi_bucket_iam" {
      - bucket = "b/broad-dsp-monster-hca-prod-ebi-storage" -> null
      - etag   = "CBo=" -> null
      - id     = "b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.admin/user:enrique@ebi.ac.uk" -> null
      - member = "user:enrique@ebi.ac.uk" -> null
      - role   = "roles/storage.admin" -> null
    }

  # google_storage_bucket_iam_member.ebi_bucket_iam["rolando@ebi.ac.uk"] will be destroyed
  - resource "google_storage_bucket_iam_member" "ebi_bucket_iam" {
      - bucket = "b/broad-dsp-monster-hca-prod-ebi-storage" -> null
      - etag   = "CBo=" -> null
      - id     = "b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.admin/user:rolando@ebi.ac.uk" -> null
      - member = "user:rolando@ebi.ac.uk" -> null
      - role   = "roles/storage.admin" -> null
    }

  # google_storage_bucket_iam_member.ucsc_bucket_iam["dsotirho@ucsc.edu"] will be destroyed
  - resource "google_storage_bucket_iam_member" "ucsc_bucket_iam" {
      - bucket = "b/broad-dsp-monster-hca-prod-ucsc-storage" -> null
      - etag   = "CBE=" -> null
      - id     = "b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.admin/user:dsotirho@ucsc.edu" -> null
      - member = "user:dsotirho@ucsc.edu" -> null
      - role   = "roles/storage.admin" -> null
    }

  # google_storage_bucket_iam_member.ucsc_bucket_iam["hannes@ucsc.edu"] will be destroyed
  - resource "google_storage_bucket_iam_member" "ucsc_bucket_iam" {
      - bucket = "b/broad-dsp-monster-hca-prod-ucsc-storage" -> null
      - etag   = "CBE=" -> null
      - id     = "b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.admin/user:hannes@ucsc.edu" -> null
      - member = "user:hannes@ucsc.edu" -> null
      - role   = "roles/storage.admin" -> null
    }

  # google_storage_bucket_iam_member.ucsc_bucket_reader_iam["platform-hca-dev-read@ucsc.edu"] will be created
  + resource "google_storage_bucket_iam_member" "ucsc_bucket_reader_iam" {
      + bucket = "broad-dsp-monster-hca-prod-ucsc-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:platform-hca-dev-read@ucsc.edu"
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.ucsc_bucket_reader_iam["platform-hca-prod-read@ucsc.edu"] will be created
  + resource "google_storage_bucket_iam_member" "ucsc_bucket_reader_iam" {
      + bucket = "broad-dsp-monster-hca-prod-ucsc-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:platform-hca-prod-read@ucsc.edu"
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.ucsc_bucket_writer_iam["platform-hca-dev-write@ucsc.edu"] will be created
  + resource "google_storage_bucket_iam_member" "ucsc_bucket_writer_iam" {
      + bucket = "broad-dsp-monster-hca-prod-ucsc-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:platform-hca-dev-write@ucsc.edu"
      + role   = "roles/storage.objectAdmin"
    }

  # google_storage_bucket_iam_member.ucsc_bucket_writer_iam["platform-hca-prod-write@ucsc.edu"] will be created
  + resource "google_storage_bucket_iam_member" "ucsc_bucket_writer_iam" {
      + bucket = "broad-dsp-monster-hca-prod-ucsc-storage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:platform-hca-prod-write@ucsc.edu"
      + role   = "roles/storage.objectAdmin"
    }

  # module.hca_dagster_runner_account.google_project_iam_member.sa_iam["bigquery.dataOwner"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataOwner"
    }

  # module.hca_dagster_runner_account.google_project_iam_member.sa_iam["bigquery.jobUser"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.jobUser"
    }

  # module.hca_dagster_runner_account.google_project_iam_member.sa_iam["compute.viewer"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/compute.viewer"
    }

  # module.hca_dagster_runner_account.google_project_iam_member.sa_iam["dataflow.developer"] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/dataflow.developer"
    }

  # module.hca_dagster_runner_account.google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id   = "hca-dagster-runner"
      + display_name = "Service account to run HCA's Dagster pipelines."
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.hca_dagster_runner_account.google_service_account_key.sa_key will be created
  + resource "google_service_account_key" "sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.hca_dagster_runner_account.null_resource.sa_delay will be created
  + resource "null_resource" "sa_delay" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.hca_dagster_runner_account.vault_generic_secret.sa_secret will be created
  + resource "vault_generic_secret" "sa_secret" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/monster/prod/ingest/hca/service-accounts/hca-dagster-runner"
    }

Plan: 17 to add, 0 to change, 4 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @raaidbroad, Action: `pull_request`, Working Directory: `/home/runner/work/monster-deploy/monster-deploy/environments/hca-prod/terraform`, Workflow: `Terraform Plan`*